In [35]:
import pandas as pd

data={"id producto": [1, 2, 1, 4, 5],
      "nombre producto":["manzana", "pera", "naranja", "plátano", "uva"],
      "precio": [50.5, None, 18.75, None, 40.0],
      "cantidad": [None, 20, None, 5, 8]}


df=pd.DataFrame(data)
df

   id producto nombre producto  precio  cantidad
0            1         manzana   50.50       NaN
1            2            pera     NaN      20.0
2            1         naranja   18.75       NaN
3            4         plátano     NaN       5.0
4            5             uva   40.00       8.0

In [36]:
df.info

<bound method DataFrame.info of    id producto nombre producto  precio  cantidad
0            1         manzana   50.50       NaN
1            2            pera     NaN      20.0
2            1         naranja   18.75       NaN
3            4         plátano     NaN       5.0
4            5             uva   40.00       8.0>

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id producto      5 non-null      int64
 1   nombre producto  5 non-null      object
 2   precio           3 non-null      float64
 3   cantidad         3 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [38]:
df.isnull().sum()

id producto        0
nombre producto    0
precio             2
cantidad           2
dtype: int64

In [39]:
dflimpio=df.dropna()
dflimpio

   id producto nombre producto  precio  cantidad
4            5             uva    40.0       8.0

In [40]:
dfrellenado=df.fillna({"precio":df["precio"].mean(),"cantidad":0})
dfrellenado

   id producto nombre producto     precio  cantidad
0            1         manzana  50.500000       0.0
1            2            pera  36.416667      20.0
2            1         naranja  18.750000       0.0
3            4         plátano  36.416667       5.0
4            5             uva  40.000000       8.0

In [41]:
dfunicos=dfrellenado.drop_duplicates(subset=["id producto"])

In [42]:
dfunicos

   id producto nombre producto     precio  cantidad
0            1         manzana  50.500000       0.0
1            2            pera  36.416667      20.0
3            4         plátano  36.416667       5.0
4            5             uva  40.000000       8.0